"""Дана строка-предложение с избыточными пробелами между словами.
Преобразовать ее так, чтобы между словами был ровно один пробел."""


def main():
    s = 'Python    one      love очень       много         пробелов'
    s = ' '.join(list(map(lambda x: x.strip(), s.split())))
    print(s)


if __name__ == '__main__':
    main()
