"""С помощью функций получить вертикальную и горизонтальную линии. Линия
проводится многократной печатью символа. Заключить слово в рамку из
полученных линий."""


def create_ramka(word):
    k = len(word)
    return ('____' + '_' * k + '____\n' +
            '|   ' + ' ' * k + '   |\n' +
            '|   ' + ' ' * k + '   |\n' +
            '|   ' + ' ' * k + '   |\n' +
            '|   ' + word + '   |\n' +
            '|   ' + ' ' * k + '   |\n' +
            '|   ' + ' ' * k + '   |\n' +
            '|   ' + ' ' * k + '   |\n' +
            '|___' + '_' * k + '___|')


def main():
    word = input('Введите слово:')
    print(create_ramka(word))


if __name__ == '__main__':
    main()
