"""В матрице найти сумму и произведение элементов строки N (N задать с клавиатуры)"""


def main():
    matrix = [[1, 2, 3, 4, 5],
              [6, 7, 8, 9, 10],
              [11, 12, 13, 14],
              [16, 17, 18, 19, 20]]
    n = input('Введите строку матрицы:')
    while not n.isdigit():
        print('ERROR это не число')
        n = input('Введите строку матрицы:')
    print(f'Сумма элементов строки N: {sum(matrix[int(n)])}')
    proiz = 1
    for i in matrix[int(n)]:
        proiz *= i
    print(f'Произведение элементов строки N: {proiz}')


if __name__ == '__main__':
    main()
